/*
 * test.h
 *
 * Created: 15.07.2015 13:17:42
 *  Author: Trol
 */ 


#ifndef TEST_H_
#define TEST_H_

#include <stddef.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>

#define CMD_RESET			0	// переводит все пины в режим чтения (не трогает нижние)
#define CMD_RESET_FULL		1	// переводит все пины в режим чтения (включая нижние)
#define CMD_INIT_16			2	// (mask[2]) настраивает порты ввода-вывода
#define CMD_INIT_24			3	// (mask[3]) настраивает порты ввода-вывода
#define CMD_INIT_28			4	// (mask[4]) настраивает порты ввода-вывода
#define CMD_SET_16			5	// (mask0[2], mask1[2]) выставляет логические 0 и 1 на выводах по маскам
#define CMD_SET_24			6	// (mask0[3], mask1[2]) выставляет логические 0 и 1 на выводах по маскам
#define CMD_SET_28			7	// (mask0[4], mask1[3]) выставляет логические 0 и 1 на выводах по маскам
#define CMD_TEST_16			8	// (mask0[2], mask1[2]) проверяет, что на выводах установлен ожидаемый уровень
#define CMD_TEST_24			9	// (mask0[3], mask1[2]) проверяет, что на выводах установлен ожидаемый уровень
#define CMD_TEST_28			10	// (mask0[4], mask1[3]) проверяет, что на выводах установлен ожидаемый уровень
#define CMD_PULSE_PLUS		11	// (pin[1]) подает положительный импульс (0 -> 1) на вывод
#define CMD_PULSE_MINUS		12	// (pin[1]) подает отрицательный импульс (1 -> 0) на вывод

#define CMD_PRINT_14		200

#define CMD_END				0xff	// признак окончания теста

bool TestLogic();

/************************************************************************
  Выполняет тест, читая программу из буфера                            
  После завершения возвращает результаты теста и переводит указатель на
  начало следующей команды
************************************************************************/
bool TestData(uint8_t **buffer);

char* GetDeviceName();



#endif /* TEST_H_ */