/*
 * tester.h
 *
 * Created: 15.07.2015 10:53:47
 *  Author: Trol
 */ 


#ifndef TESTER_IO_H_
#define TESTER_IO_H_

#include <stddef.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>

#include "debug.h"

/************************************************************************
  Устанавливает все пины на чтение и отключает подтяжку                
  Если fullMode установлен, то будут инициализированы нижние пины
  (клавиши и UART)                                                      
************************************************************************/
void TesterReset(bool fullMode);

/************************************************************************
  Конфигурирует верхние пины на чтение/запись согласно битовой маске   
  Младший бит соответствует первому пину, старший - последнему
  Пин конфигурируется на запись если бит установлен                    
************************************************************************/
void TesterConfig16(uint16_t mask);
void TesterConfig28(uint32_t mask);


/************************************************************************
  Устанавливает пины по маске mask1 и сбрасывает по маске mask0
************************************************************************/
void TesterSet16(uint16_t mask0, uint16_t mask1);
void TesterSet28(uint32_t mask0, uint32_t mask1);

/************************************************************************
  Проверяет, что биты маски mask1 установлены, а биты маски mask0 сброшены
************************************************************************/
bool TesterTest16(uint16_t mask0, uint16_t mask1);
bool TesterTest28(uint32_t mask0, uint32_t mask1);


/************************************************************************
  Возвращает true, если все пины сейчас задействованы для теста микросхемы
  В этом случае дополнительные клавиши и UART недоступны
************************************************************************/
bool IsFullMode();


/************************************************************************/
/* Выводит в UART состояние пинов МС                                    */
/************************************************************************/
void TesterDebugStatus();

#endif // TESTER_IO_H_